      *** VISUALIZAR MAESTRO DE ALUMNOS - ENTRADA ARCHIVO ORDENADO ****
	IDENTIFICATION DIVISION.
	PROGRAM-ID. MLISP1-S.      
	ENVIRONMENT DIVISION.
	CONFIGURATION SECTION.
	SPECIAL-NAMES.
		    DECIMAL-POINT IS COMMA.
	INPUT-OUTPUT SECTION.
	FILE-CONTROL.
            SELECT MAESTRO ASSIGN TO DISK "MALU01.SEC"
            ORGANIZATION IS SEQUENTIAL
            ACCESS IS SEQUENTIAL.
            SELECT IMPRE ASSIGN TO PRINT  "LPT1".
       DATA DIVISION.
       FILE SECTION.
       FD  MAESTRO
	    LABEL RECORD IS STANDARD
	    RECORD CONTAINS 51 CHARACTERS
	    DATA RECORD IS R-MAE.
       01  R-MAE.
	    02 MCA  PIC 9(8).
	    02 MAN  PIC X(30).
	    02 MED  PIC 9(3).
	    02 MSE  PIC 9.
	    02 MEC  PIC 9.
	    02 MFI.
	       03  MDD	PIC 9(2).
	       03  MMM	PIC 9(2).
	       03  MAA	PIC 9(2).
	    02 MCU  PIC 9(2).
       FD   IMPRE
	    LABEL RECORD IS OMITTED
	    RECORD CONTAINS 80 CHARACTERS
	    LINAGE 24 FOOTING 20
	    DATA RECORD IS R-IMP.
       01   R-IMP  PIC X(80).

       WORKING-STORAGE SECTION.
       77 FST		     PIC XX.
       77 MTVC		     PIC 9(5) VALUE 0.
       77 MTVE		     PIC 9(5) VALUE 0.
       77 MTMSE		     PIC 9(5) VALUE 0.
       77 MTMSC		     PIC 9(5) VALUE 0.
       77 MTAC1		     PIC 9(5) VALUE 0.
       77 MTAC2		     PIC 9(5) VALUE 0.
       77 MTAC3		     PIC 9(5) VALUE 0.
       77 WTE		     PIC 9(5) VALUE 0.
       77 L		     PIC 9(2) VALUE 0.
       77 C-T		     PIC 99.
       77 TECLA 	     PIC X.
       77 ZCU 	             PIC X(7).
       77 ZSE 	             PIC X(9).
       77 ZEC 	             PIC X(7).

       01  WFECHA.
	   02 WAA		  PIC 99.
	   02 WMM		  PIC 99.
	   02 WDD		  PIC 99.

       01 T-CAB.
	  02 FILLER PIC X(30) VALUE  SPACES.
	  02 FILLER PIC X(19) VALUE  "PADRON DE EMPLEADOS".
	  02 FILLER PIC X(23) VALUE  SPACES.
	  02 SDD    PIC Z9/.
	  02 SMM    PIC 99/.
	  02 SAA    PIC 9(2).

       01 T-DET.
	  02 FILLER PIC X(11) VALUE  "NRO.ALUMNO".
	  02 FILLER PIC X(01) VALUE  SPACES.
	  02 FILLER PIC X(30) VALUE  "	    APELLIDO Y NOMBRES	    ".
	  02 FILLER PIC X(01) VALUE  SPACES.
	  02 FILLER PIC X(04) VALUE  "EDAD".
	  02 FILLER PIC X(03) VALUE  SPACES.
	  02 FILLER PIC X(04) VALUE  "SEXO".
	  02 FILLER PIC X(05) VALUE  SPACES.
	  02 FILLER PIC X(09) VALUE  "EST CIVIL".
	  02 FILLER PIC X(03) VALUE  SPACES.
	  02 FILLER PIC X(05) VALUE  "CURSO".
       01  S-T-DET.
	   02 FILLER PIC X(11) VALUE ALL "-".
	   02 FILLER PIC X(01) VALUE  SPACES.
	   02 FILLER PIC X(30) VALUE ALL "-".
	   02 FILLER PIC X(01) VALUE  SPACES.
	   02 FILLER PIC X(04) VALUE ALL "-".
	   02 FILLER PIC X(01) VALUE  SPACES.
	   02 FILLER PIC X(09) VALUE ALL "-".
	   02 FILLER PIC X(01) VALUE  SPACES.
	   02 FILLER PIC X(11) VALUE ALL "-".
           02 FILLER PIC X(01) VALUE  SPACES.
	   02 FILLER PIC X(07) VALUE ALL "-".

       01  L-DET.
	   02 FILLER PIC X(01) VALUE  SPACES.
	   02 DCA    PIC 9(08).
	   02 FILLER PIC X(04) VALUE  SPACES.
	   02 DAN    PIC X(30).
	   02 FILLER PIC X(01) VALUE  SPACES.
	   02 DED    PIC 9(03).
	   02 FILLER PIC X(01) VALUE  SPACES.
	   02 DSE    PIC X(09).
	   02 FILLER PIC X(02) VALUE  SPACES.
	   02 DEC    PIC X(07).
           02 FILLER PIC X(04) VALUE  SPACES.
	   02 DCU    PIC X(07).

       01 L-TOT1.
	  02 FILLER PIC X(16) VALUE SPACES.
	  02 FILLER PIC X(20) VALUE "TOTAL DE VARONES CAS".
	  02 FILLER PIC X(20) VALUE "ADOS.	        ".
	  02 FILLER PIC X(06) VALUE "    : ".
	  02 STVC   PIC ZZ.ZZ9.
	  02 FILLER PIC X(22) VALUE SPACES.
       01 L-TOT2.
	  02 FILLER PIC X(16) VALUE SPACES.
	  02 FILLER PIC X(20) VALUE "TOTAL DE VARONES ENT".
	  02 FILLER PIC X(20) VALUE "RE 20 Y 40 A¥OS     ".
	  02 FILLER PIC X(06) VALUE "    : ".
	  02 STVE   PIC ZZ.ZZ9.
	  02 FILLER PIC X(22) VALUE SPACES.
       01 L-TOT3.
	  02 FILLER PIC X(16) VALUE SPACES.
	  02 FILLER PIC X(20) VALUE "TOTAL MUJERES SOLTER".
	  02 FILLER PIC X(20) VALUE "AS ENTRE 16 Y 25    ".
	  02 FILLER PIC X(06) VALUE "    : ".
	  02 STMSE   PIC ZZ.ZZ9.
	  02 FILLER PIC X(22) VALUE SPACES.
       01 L-TOT4.
	  02 FILLER PIC X(16) VALUE SPACES.
	  02 FILLER PIC X(20) VALUE "TOTAL MUJERES SOLTER".
	  02 FILLER PIC X(20) VALUE "AS CON 25 A¥OS Y MAS".
	  02 FILLER PIC X(06) VALUE "    : ".
	  02 STMSC   PIC ZZ.ZZ9.
	  02 FILLER PIC X(22) VALUE SPACES.
       01 L-TOT5.
	  02 FILLER PIC X(16) VALUE SPACES.
	  02 FILLER PIC X(20) VALUE "TOTAL DE ALUMNOS EN ".
	  02 FILLER PIC X(20) VALUE "PRIMER A¥O          ".
	  02 FILLER PIC X(06) VALUE "    : ".
	  02 STAC1   PIC ZZ.ZZ9.
	  02 FILLER PIC X(22) VALUE SPACES.
       01 L-TOT6.
	  02 FILLER PIC X(16) VALUE SPACES.
	  02 FILLER PIC X(20) VALUE "TOTAL DE ALUMNOS EN ".
	  02 FILLER PIC X(20) VALUE "SEGUNDO A¥O:        ".
	  02 FILLER PIC X(06) VALUE "    : ".
	  02 STAC2   PIC ZZ.ZZ9.
	  02 FILLER PIC X(22) VALUE SPACES.
       01 L-TOT7.
	  02 FILLER PIC X(16) VALUE SPACES.
	  02 FILLER PIC X(20) VALUE "TOTAL DE ALUMNOS EN ".
	  02 FILLER PIC X(20) VALUE "TERCER A¥O:         ".
	  02 FILLER PIC X(06) VALUE "    : ".
	  02 STAC3   PIC ZZ.ZZ9.
	  02 FILLER PIC X(22) VALUE SPACES.
       01 L-TOT8.
	  02 FILLER PIC X(16) VALUE SPACES.
	  02 FILLER PIC X(20) VALUE "TOTAL DE ALUMNOS EN ".
	  02 FILLER PIC X(20) VALUE "ESTABLECIMIENTO:   ".
	  02 FILLER PIC X(06) VALUE "    : ".
	  02 STE    PIC ZZ.ZZ9.
	  02 FILLER PIC X(22) VALUE SPACES.
       PROCEDURE DIVISION.
       INICIO.
	    OPEN INPUT	MAESTRO
		OUTPUT IMPRE
	    IF FST  > "00" GO TO FIN
	    END-IF.
	    ACCEPT WFECHA FROM DATE.
       S-TITULOS.
	    PERFORM IMP-TIT.
       PROCESO.
	    PERFORM LEER-M.
	    PERFORM PROC-R.
	    PERFORM MOVER-R.
	    PERFORM IMP-LD.
	    GO TO PROCESO.
       LEER-M.
	    READ MAESTRO NEXT RECORD AT END GO TO IMP-TOT.
       PROC-R.
            ADD 1 TO WTE
            IF MSE = 1
              MOVE "HOMBRE" TO ZSE
               IF MEC = 1
                   MOVE "SOLTERO" TO ZEC
                     ELSE IF MEC = 2
                        MOVE "CASADO" TO ZEC.

            IF MSE = 2
              MOVE "MUJER" TO ZSE
               IF MEC = 1
                   MOVE "SOLTERA" TO ZEC
                     ELSE IF MEC = 2
                        MOVE "CASADA" TO ZEC.
            IF MCU = 1
              ADD 1 TO MTAC1
              MOVE "PRIMERO" TO ZCU
                ELSE IF MCU = 2
                   ADD 1 TO MTAC2
                   MOVE "SEGUNDO" TO ZCU
                  ELSE IF MCU = 3
                     ADD 1 TO MTAC3
                     MOVE "TERCERO" TO ZCU.

	    IF MSE = 1 AND MEC = 2
		ADD 1 TO MTVC
	    END-IF.

	    IF MSE = 1 AND (MED >= 20 AND MED <= 40)
		ADD 1 TO MTVE
	    END-IF.

	    IF MSE = 2 AND MEC = 1 AND(MED >= 16 AND MED <= 25)
		ADD 1 TO MTMSE
	    END-IF.

	    IF MSE = 2 AND MEC = 1 AND MED >= 25
		ADD 1 TO MTMSC
	    END-IF.
       MOVER-R.
	    MOVE MCA TO DCA.
	    MOVE MAN TO DAN.
	    MOVE MED TO DED.
	    MOVE ZSE TO DSE.
	    MOVE ZEC TO DEC.
	    MOVE ZCU TO DCU.
       IMP-TIT.
	    DISPLAY " " ERASE.
	    MOVE 2 TO L.
	    MOVE SPACES TO R-IMP.
	    MOVE WDD TO SDD.
	    MOVE WMM TO SMM.
	    MOVE WAA TO SAA.
	    MOVE T-CAB TO R-IMP.
	    DISPLAY R-IMP LINE L CONTROL "FCOLOR=WHILE,BCOLOR=BLACK".
		MOVE SPACES TO R-IMP.
		MOVE T-DET  TO R-IMP.
		ADD 1 TO L.
	      DISPLAY R-IMP LINE L CONTROL "FCOLOR=BLUE,BCOLOR=GREEN".
		MOVE SPACES  TO R-IMP.
		ADD 1 TO L.
		MOVE S-T-DET TO R-IMP.
		DISPLAY R-IMP LINE L.
       IMP-LD.
	       MOVE SPACES TO R-IMP.
	       MOVE L-DET  TO R-IMP.
	       ADD 1 TO L.
	       DISPLAY R-IMP LINE L CONTROL "FCOLOR=GREEN,BCOLOR=BLUE".
      	       IF L = 20 OR L > 20
      		PERFORM ING-TECLA
               END-IF.
       ING-TECLA.
	    ADD 2 TO L.
	    DISPLAY "PULSE UNA TECLA PARA CONTINUAR", LINE L
	    CONTROL "FCOLOR=RED,BCOLOR=BLUE"
	    ACCEPT TECLA
		  IF FST NOT = "10"
		     PERFORM IMP-TIT
		  END-IF.

       IMP-TOT.
	    MOVE WTE   TO STE.
	    MOVE MTVC  TO STVC.
	    MOVE MTVE  TO STVE.
	    MOVE MTMSE TO STMSE.
	    MOVE MTMSC TO STMSC.
	    MOVE MTAC1 TO STAC1.
	    MOVE MTAC2 TO STAC2.
	    MOVE MTAC3 TO STAC3.
	    MOVE SPACES TO R-IMP.
	       MOVE L-TOT1 TO R-IMP.
	       ADD 2 TO L.
	    DISPLAY R-IMP LINE L.
	       MOVE L-TOT2 TO R-IMP.
	       ADD 1 TO L.
	    DISPLAY R-IMP LINE L.
	       MOVE L-TOT3 TO R-IMP.
	       ADD 1 TO L.
	    DISPLAY R-IMP LINE L.
	       MOVE L-TOT4 TO R-IMP.
	       ADD 1 TO L.
	    DISPLAY R-IMP LINE L.
	       MOVE L-TOT5 TO R-IMP.
	       ADD 1 TO L.
	    DISPLAY R-IMP LINE L.
	       MOVE L-TOT6 TO R-IMP.
	       ADD 1 TO L.
	    DISPLAY R-IMP LINE L.
	       MOVE L-TOT7 TO R-IMP.
	       ADD 1 TO L.
	    DISPLAY R-IMP LINE L.
	       MOVE L-TOT8 TO R-IMP.
	       ADD 1 TO L.
	    DISPLAY R-IMP LINE L.
	       PERFORM ING-TECLA.


       FIN.
	    DISPLAY " " ERASE CONTROL "FCOLOR=WHITE,BCOLOR=BLACK".
	    IF	FST  > "00" AND FST NOT = "10"
	    DISPLAY " ERROR EN LA APERTURA " FST LINE 23, POSITION 26
	    END-IF.
	    CLOSE MAESTRO IMPRE.
            EXIT PROGRAM.
      *	    STOP RUN.