      **SALIDA POR IMPRESORA EN 80 POSICIONES, ENTRADA ARCHIVO ORDENADO**
      ** PARA QUE TOME LA IMPRESORA CON PTO. USB CORRER EL Pgm DOSPRN **
	IDENTIFICATION DIVISION.
	PROGRAM-ID. MODLI2-I.
	ENVIRONMENT DIVISION.
	CONFIGURATION SECTION.
	SPECIAL-NAMES.
		    DECIMAL-POINT IS COMMA.
	INPUT-OUTPUT SECTION.
	FILE-CONTROL.
            SELECT MAESTRO ASSIGN TO DISK "MALU01.ORD"
            ORGANIZATION IS SEQUENTIAL
            ACCESS IS SEQUENTIAL.

      ***   INDICAR EL PUERTO DE LA IMPRESORA EN ESTE CASO "USB001" --**
	     SELECT IMPRE ASSIGN TO PRINT  "USB001".
       DATA DIVISION.
       FILE SECTION.
       FD  MAESTRO
      	    LABEL RECORD IS STANDARD
	    RECORD CONTAINS 51 CHARACTERS
	    DATA RECORD IS R-MAE.
       01  R-MAE.
 	    02 MCA  PIC 9(8).
	    02 MAN  PIC X(30).
	    02 MED  PIC 9(3).
	    02 MSE  PIC 9.
	    02 MEC  PIC 9.
	    02 MFI.
	       03  MDD	PIC 9(2).
	       03  MMM	PIC 9(2).
	       03  MAA	PIC 9(2).
	    02 MCU  PIC 9(2).
       FD   IMPRE
            LINAGE 62 FOOTING 60
       	    DATA RECORD IS R-IMP.
       01   R-IMP  PIC X(80).

       WORKING-STORAGE SECTION.
       77 FST		     PIC XX.
       77 WTE                PIC 9(5) VALUE 0.
       77 MTVC               PIC 9(5) VALUE 0.
       77 MTVE		     PIC 9(5) VALUE 0.
       77 MTMSE		     PIC 9(5) VALUE 0.
       77 MTMSC		     PIC 9(5) VALUE 0.
       77 MTAC1		     PIC 9(5) VALUE 0.
       77 MTAC2		     PIC 9(5) VALUE 0.
       77 MTAC3		     PIC 9(5) VALUE 0.
       77 TECLA      PIC X.

       01  WFECHA.
	   02 WAA		   PIC 99.
	   02 WMM		   PIC 99.
	   02 WDD		   PIC 99.

       01 T-CAB.
	  02 FILLER PIC X(30) VALUE  SPACES.
	  02 FILLER PIC X(19) VALUE  "PADRON DE ALUMNOS".
	  02 FILLER PIC X(23) VALUE  SPACES.
	  02 SDD    PIC Z9/.
	  02 SMM    PIC 99/.
	  02 SAA    PIC 9(2).

       01 T-DET.
	  02 FILLER PIC X(12) VALUE  "NRO.ALUMNO".
	  02 FILLER PIC X(01) VALUE  SPACES.
	  02 FILLER PIC X(30) VALUE  "	    APELLIDO Y NOMBRES	    ".
	  02 FILLER PIC X(01) VALUE  SPACES.
	  02 FILLER PIC X(04) VALUE  "EDAD".
	  02 FILLER PIC X(01) VALUE  SPACES.
	  02 FILLER PIC X(04) VALUE  "SEXO".
	  02 FILLER PIC X(01) VALUE  SPACES.
	  02 FILLER PIC X(12) VALUE  "ESTADO CIVIL".
	  02 FILLER PIC X(01) VALUE  SPACES.
	  02 FILLER PIC X(13) VALUE  "FECHA INGRESO".
          02 FILLER PIC X(01) VALUE  SPACES.
	  02 FILLER PIC X(05) VALUE  "CURSO".


       01  S-T-DET.
	   02 FILLER PIC X(12) VALUE ALL "-".
	   02 FILLER PIC X(01) VALUE  SPACES.
	   02 FILLER PIC X(30) VALUE ALL "-".
	   02 FILLER PIC X(01) VALUE  SPACES.
	   02 FILLER PIC X(04) VALUE ALL "-".
	   02 FILLER PIC X(01) VALUE  SPACES.
	   02 FILLER PIC X(04) VALUE ALL "-".
	   02 FILLER PIC X(01) VALUE  SPACES.
	   02 FILLER PIC X(12) VALUE ALL "-".
	   02 FILLER PIC X(01) VALUE  SPACES.
	   02 FILLER PIC X(13) VALUE ALL "-".
	   02 FILLER PIC X(01) VALUE  SPACES.
	   02 FILLER PIC X(05) VALUE ALL "-".

       01  L-DET.
	   02 FILLER PIC X(05) VALUE  SPACES.
	   02 DCA    PIC 9(03).
	   02 FILLER PIC X(05) VALUE  SPACES.
	   02 DAN    PIC X(30).
	   02 FILLER PIC X(02) VALUE  SPACES.
	   02 DED    PIC 9(03).
	   02 FILLER PIC X(02) VALUE  SPACES.
	   02 DSE    PIC X(01).
	   02 FILLER PIC X(08) VALUE  SPACES.
	   02 DEC    PIC X(01).
	   02 FILLER PIC X(08) VALUE  SPACES.
	   02 DCU    PIC X(01).
	   02 FILLER PIC X(12) VALUE  SPACES.
	   02 DDD    PIC Z9/.
	   02 DMM    PIC 99/.
	   02 DAA    PIC 9(02).

       01 L-TOT1.
	  02 FILLER PIC X(16) VALUE SPACES.
	  02 FILLER PIC X(20) VALUE "TOTAL DE VARONES CAS".
	  02 FILLER PIC X(20) VALUE "ADOS.	        ".
	  02 FILLER PIC X(06) VALUE "    : ".
	  02 STVC   PIC ZZ.ZZ9.
	  02 FILLER PIC X(22) VALUE SPACES.
       01 L-TOT2.
	  02 FILLER PIC X(16) VALUE SPACES.
	  02 FILLER PIC X(20) VALUE "TOTAL DE VARONES ENT".
	  02 FILLER PIC X(20) VALUE "RE 20 Y 40 A¥OS     ".
	  02 FILLER PIC X(06) VALUE "    : ".
	  02 STVE   PIC ZZ.ZZ9.
	  02 FILLER PIC X(22) VALUE SPACES.
       01 L-TOT3.
	  02 FILLER PIC X(16) VALUE SPACES.
	  02 FILLER PIC X(20) VALUE "TOTAL MUJERES SOLTER".
	  02 FILLER PIC X(20) VALUE "AS ENTRE 16 Y 25    ".
	  02 FILLER PIC X(06) VALUE "    : ".
	  02 STMSE   PIC ZZ.ZZ9.
	  02 FILLER PIC X(22) VALUE SPACES.
       01 L-TOT4.
	  02 FILLER PIC X(16) VALUE SPACES.
	  02 FILLER PIC X(20) VALUE "TOTAL MUJERES SOLTER".
	  02 FILLER PIC X(20) VALUE "AS CON 25 A¥OS Y MAS".
	  02 FILLER PIC X(06) VALUE "    : ".
	  02 STMSC   PIC ZZ.ZZ9.
	  02 FILLER PIC X(22) VALUE SPACES.
       01 L-TOT5.
	  02 FILLER PIC X(16) VALUE SPACES.
	  02 FILLER PIC X(20) VALUE "TOTAL DE ALUMNOS EN ".
	  02 FILLER PIC X(20) VALUE "PRIMER A¥O          ".
	  02 FILLER PIC X(06) VALUE "    : ".
	  02 STAC1   PIC ZZ.ZZ9.
	  02 FILLER PIC X(22) VALUE SPACES.
       01 L-TOT6.
	  02 FILLER PIC X(16) VALUE SPACES.
	  02 FILLER PIC X(20) VALUE "TOTAL DE ALUMNOS EN ".
	  02 FILLER PIC X(20) VALUE "SEGUNDO A¥O:        ".
	  02 FILLER PIC X(06) VALUE "    : ".
	  02 STAC2   PIC ZZ.ZZ9.
	  02 FILLER PIC X(22) VALUE SPACES.
       01 L-TOT7.
	  02 FILLER PIC X(16) VALUE SPACES.
	  02 FILLER PIC X(20) VALUE "TOTAL DE ALUMNOS EN ".
	  02 FILLER PIC X(20) VALUE "TERCER A¥O:         ".
	  02 FILLER PIC X(06) VALUE "    : ".
	  02 STAC3   PIC ZZ.ZZ9.
	  02 FILLER PIC X(22) VALUE SPACES.
       01 L-TOT8.
	  02 FILLER PIC X(16) VALUE SPACES.
	  02 FILLER PIC X(20) VALUE "TOTAL DE ALUMNOS EN ".
	  02 FILLER PIC X(20) VALUE "ESTABLECIMIENTO:   ".
	  02 FILLER PIC X(06) VALUE "    : ".
	  02 STE    PIC ZZ.ZZ9.
	  02 FILLER PIC X(22) VALUE SPACES.

       PROCEDURE DIVISION.
       INICIO.
	    OPEN INPUT	MAESTRO
		  OUTPUT IMPRE
	    ACCEPT WFECHA FROM DATE.
       S-TITULOS.
	    PERFORM IMP-TIT.


       PROCESO.
	    PERFORM LEER-M.
	    PERFORM PROC-R.
	    PERFORM MOVER-R.
	    PERFORM IMP-LD.
	    GO TO PROCESO.
       LEER-M.
	      READ MAESTRO AT END GO TO IMP-TOT.

       PROC-R.
V         MOVER-R.
	    MOVE MCA TO DCA.
	    MOVE MAN TO DAN.
	    MOVE MED TO DED.
	    MOVE MSE TO DSE.
	    MOVE MEC TO DEC.
	    MOVE MCU TO DCU.
	    MOVE MDD TO DDD.
	    MOVE MMM TO DMM.
	    MOVE MAA TO DAA.

       IMP-TIT.
	    MOVE SPACES TO R-IMP.
	    MOVE WDD TO SDD.
	    MOVE WMM TO SMM.
	    MOVE WAA TO SAA.
	    IF WTE = 0
	       WRITE R-IMP FROM T-CAB
	    ELSE
	       WRITE R-IMP FROM T-CAB	AFTER PAGE
	    END-IF.
	       WRITE R-IMP FROM T-DET	AFTER 2
	       WRITE R-IMP FROM S-T-DET AFTER 1.

       IMP-LD.
	    WRITE R-IMP FROM L-DET   AFTER 1
		 AT EOP PERFORM IMP-TIT.

       IMP-TOT.
	    MOVE WTE   TO STE.
	    MOVE MTVC  TO STVC.
	    MOVE MTVE  TO STVE.
	    MOVE MTMSE TO STMSE.
	    MOVE MTMSC TO STMSC.
	    MOVE MTAC1 TO STAC1.
	    MOVE MTAC2 TO STAC2.
	    MOVE MTAC3 TO STAC3.
	    WRITE R-IMP FROM L-TOT1  AFTER 3.
	    WRITE R-IMP FROM L-TOT2  AFTER 1.
	    WRITE R-IMP FROM L-TOT3  AFTER 1.
	    WRITE R-IMP FROM L-TOT4  AFTER 1.
	    WRITE R-IMP FROM L-TOT5  AFTER 1.
	    WRITE R-IMP FROM L-TOT6  AFTER 1.
	    WRITE R-IMP FROM L-TOT7  AFTER 1.
	    WRITE R-IMP FROM L-TOT8  AFTER 1.
	    MOVE SPACES TO R-IMP.
	    WRITE R-IMP.

       FIN.
	    DISPLAY "IMPRIMIENDO->CONTROLE LA IMPRESORA..TARDA UN POCO"
	     LINE 20, POSITION 01 CONTROL "FCOLOR=RED", BLINK
	    DISPLAY "PULSE EL  BOTON DEL PAPEL.....CUANDO TINTINEA"
	     LINE 22, POSITION 30 CONTROL "FCOLOR=RED"
	    DISPLAY "PULSE UNA TECLA PARA CONTINUAR"
	     LINE 23, POSITION 01 CONTROL "FCOLOR=GREEN", BLINK
	     ACCEPT TECLA
	    DISPLAY " " ERASE CONTROL "FCOLOR=WHITE,BCOLOR=BLACK".
	    IF	FST  > "00" AND FST NOT = "10"
	    DISPLAY " ERROR EN LA APERTURA " FST LINE 23, POSITION 26
	    END-IF.
	    CLOSE MAESTRO IMPRE
	    EXIT PROGRAM.
      *      STOP RUN.
