      *** VISUALIZAR MAESTRO -ENTRADA ARCHIVO INDEXADO *****
	IDENTIFICATION DIVISION.
	PROGRAM-ID. MLISP1-I.
	ENVIRONMENT DIVISION.
	CONFIGURATION SECTION.
	SPECIAL-NAMES.
		    DECIMAL-POINT IS COMMA.
	INPUT-OUTPUT SECTION.
	FILE-CONTROL.
	    SELECT MAESTRO ASSIGN TO DISK "MAEEMP.IND"
	     ORGANIZATION IS INDEXED
	     ACCESS IS DYNAMIC
	     RECORD KEY IS MCA
	     ALTERNATE RECORD KEY IS MAN DUPLICATES
	     FILE STATUS IS FST.

           SELECT MAELOC ASSIGN TO DISK "LOCALIDAD.IND"
           ORGANIZATION IS INDEXED
           ACCESS IS DYNAMIC
           RECORD KEY IS MLOC
           ALTERNATE RECORD KEY IS MLDESC DUPLICATES
           FILE STATUS IS FSTLOC.

	       SELECT IMPRESORA ASSIGN TO PRINT  "USB001".
       DATA DIVISION.
       FILE SECTION.
       FD MAESTRO
	    LABEL RECORD IS STANDARD
	    RECORD CONTAINS 44 CHARACTERS
	    DATA RECORD IS R-CLI.
       01  R-CLI.
            02 MCA  PIC 9(08).
            02 MAN  PIC X(30).
            02 MSB  PIC 9(05).
            02 MLO  PIC 9(1).

       FD MAELOC
           LABEL RECORD IS STANDARD
           RECORD CONTAINS 16 CHARACTERS
           DATA RECORD IS R-LOC.

       01 R-LOC.
            02 MLOC     PIC 9(1).
            02 MLDESC   PIC X(15).

       FD IMPRESORA
	    LABEL RECORD IS OMITTED
	    RECORD CONTAINS 80 CHARACTERS
	    LINAGE 24 FOOTING 20

	    DATA RECORD IS R-IMP.
       01   R-IMP  PIC X(80).

       WORKING-STORAGE SECTION.
       77 FST		     PIC XX.
       77 FSTLOC         PIC XX.
       77 MTE		     PIC 9(5) VALUE 0.
       77 MTS		     PIC 9(12) VALUE 0.
       77 MTSP		     PIC 9(8) VALUE 0.
       77 MMLO           PIC X(10).
       77 WLOC           PIC 9(1).
       77 WDLOC          PIC X(15).
       77 L		         PIC 9(2) VALUE 0.
       77 C-T		     PIC 99.
       77 TECLA 	     PIC X.
       01 WFECHA.
	       02 WAA		  PIC 99.
	       02 WMM		  PIC 99.
	       02 WDD		  PIC 99.

       01 TITULO-CABECERA.
      	  02 FILLER PIC X(30) VALUE  SPACES.
      	  02 FILLER PIC X(19) VALUE  "PADRON DE EMPLEADOS".
      	  02 FILLER PIC X(23) VALUE  SPACES.
      	  02 SDD    PIC Z9/.
      	  02 SMM    PIC 99/.
      	  02 SAA    PIC 9(2).

       01 TITULOS-DETALLES.
    	  02 FILLER PIC X(12) VALUE  "DNI.EMPLEADO".
    	  02 FILLER PIC X(01) VALUE  SPACES.
    	  02 FILLER PIC X(30) VALUE  "	    APELLIDO Y NOMBRES	    ".
    	  02 FILLER PIC X(01) VALUE  SPACES.
    	  02 FILLER PIC X(06) VALUE  "SUELDO".
    	  02 FILLER PIC X(03) VALUE  SPACES.
    	  02 FILLER PIC X(12) VALUE  "LOCALIDAD".
    	  02 FILLER PIC X(03) VALUE  SPACES.




       01  SUBRAYAR-TITULOS-DETALLES.
    	   02 FILLER PIC X(12) VALUE ALL "-".
    	   02 FILLER PIC X(01) VALUE  SPACES.
    	   02 FILLER PIC X(30) VALUE ALL "-".
    	   02 FILLER PIC X(01) VALUE  SPACES.
    	   02 FILLER PIC X(06) VALUE ALL "-".
    	   02 FILLER PIC X(03) VALUE  SPACES.
    	   02 FILLER PIC X(09) VALUE ALL "-".

       01  SALIDAS-DE-DETALLES.
      	   02 DCA    PIC 9(08).
      	   02 FILLER PIC X(05) VALUE  SPACES.
      	   02 DAN    PIC X(20).
      	   02 FILLER PIC X(11) VALUE  SPACES.
      	   02 DSB    PIC X(05).
      	   02 FILLER PIC X(5) VALUE  SPACES.
      	   02 DLO    PIC X(10).
	   



       01  SALIDA-DE-TOTALES1.
    	   02 FILLER PIC X(3) VALUE SPACES.
    	   02 FILLER PIC X(19) VALUE "TOTAL EMPLEADOS    ".
    	   02 FILLER PIC X(10) VALUE "        =   ".
           02 SMTE   PIC Z.ZZZ.ZZ9.
    	   02 FILLER PIC X(22) VALUE SPACES.

       01  SALIDA-DE-TOTALES2.
    	   02 FILLER PIC X(3) VALUE SPACES.
    	   02 FILLER PIC X(19) VALUE "TOTAL SUELDOS      ".
    	   02 FILLER PIC X(10) VALUE "	      =".
    	   02 SMTSB  PIC Z.ZZZ.ZZ9.
    	   02 FILLER PIC X(22) VALUE SPACES.

       01  SALIDA-DE-TOTALES3.
    	   02 FILLER PIC X(3) VALUE SPACES.
    	   02 FILLER PIC X(19) VALUE "PROMEDIO SUELDOS   ".
    	   02 FILLER PIC X(10) VALUE "	      =   ".
    	   02 SMTSP  PIC Z.ZZZ.ZZ9.
    	   02 FILLER PIC X(22) VALUE SPACES.




       PROCEDURE DIVISION.
       INICIO.
	    OPEN INPUT MAESTRO
                   OUTPUT IMPRESORA
	    ACCEPT WFECHA FROM DATE.
       SALIDA-TITULOS.
	    PERFORM IMPRIMIR-TITULOS.


       PROCESO.
	    PERFORM LEER-MAESTRO.
	    PERFORM PROCESAR-REGISTRO.
	    PERFORM MOVER-A-SALIDA.
	    PERFORM IMPRIMIR-DETALLES.
	    GO TO PROCESO.
       LEER-MAESTRO.
	      READ MAESTRO NEXT RECORD AT END GO TO IMPRIMIR-TOTALES.

       PROCESAR-REGISTRO.
           OPEN I-O MAELOC
           MOVE MLO TO MLOC
           START MAELOC KEY IS EQUAL MLOC
                 INVALID KEY MOVE "NO" TO WDLOC.

            READ MAELOC NOT INVALID
                 MOVE "SI" TO WDLOC
                 MOVE  MLDESC TO WDLOC
           CLOSE MAELOC.

            ADD 1 TO MTE
            ADD MSB TO MTS
            DIVIDE MTE INTO MTS GIVING MTSP .
      *      IF MLO = 1
      *         MOVE "POSADAS" TO MMLO.
      *      IF MLO = 2
      *         MOVE "GARUPA" TO MMLO.
      *      IF MLO = 3
      *         MOVE "CANDELARIA" TO MMLO.
      *      IF MLO = 4
      *         MOVE "STA ANA" TO MMLO.
       MOVER-A-SALIDA.
	      MOVE MCA TO DCA.
	      MOVE MAN TO DAN.
	      MOVE MSB TO DSB.
	      MOVE WDLOC TO DLO.


       IMPRIMIR-TITULOS.
	    DISPLAY " " ERASE.
	    MOVE 2 TO L.
	    MOVE SPACES TO R-IMP.
	    MOVE WDD TO SDD.
	    MOVE WMM TO SMM.
	    MOVE WAA TO SAA.

	    MOVE TITULO-CABECERA TO R-IMP.
	    DISPLAY R-IMP LINE L CONTROL "FCOLOR=WHILE,BCOLOR=BLACK".
		MOVE SPACES TO R-IMP.
		MOVE TITULOS-DETALLES TO R-IMP.
		ADD 1 TO L.
	      DISPLAY R-IMP LINE L CONTROL "FCOLOR=WHITE,BCOLOR=BLACK".
		MOVE SPACES  TO R-IMP.
		ADD 1 TO L.
		MOVE SUBRAYAR-TITULOS-DETALLES TO R-IMP.
		DISPLAY R-IMP LINE L.
       IMPRIMIR-DETALLES.
            MOVE SPACES TO R-IMP.
            MOVE SALIDAS-DE-DETALLES TO R-IMP.
            ADD 1 TO L.
            DISPLAY R-IMP LINE L CONTROL "FCOLOR=GREEN,BCOLOR=BLACK".
      ** para indicar cada cuantas va el titulo **
            IF L = 24 OR L > 24
            PERFORM ING-TECLA
            END-IF.
       ING-TECLA.
	    ADD 2 TO L.
	    DISPLAY "PULSE UNA TECLA PARA CONTINUAR", LINE L
	    CONTROL "FCOLOR=RED,BCOLOR=BLACK"
	    ACCEPT TECLA
		  IF FST NOT = "10"
		     PERFORM IMPRIMIR-TITULOS
		  END-IF.

       IMPRIMIR-TOTALES.
	    MOVE MTE TO SMTE.
	    MOVE MTS TO SMTSB.
	    MOVE MTSP TO SMTSP.

	    MOVE SPACES TO R-IMP.
	       MOVE SALIDA-DE-TOTALES1 TO R-IMP.
	       ADD 2 TO L.
	    DISPLAY R-IMP LINE L.
	       MOVE SALIDA-DE-TOTALES2 TO R-IMP.
	       ADD 1 TO L.
	    DISPLAY R-IMP LINE L.
	       MOVE SALIDA-DE-TOTALES3 TO R-IMP.
	       ADD 1 TO L.


	    DISPLAY R-IMP LINE L.
	       PERFORM ING-TECLA.


       FIN.
	    DISPLAY " " ERASE CONTROL "FCOLOR=WHITE,BCOLOR=BLACK".
	    IF	FST  > "00" AND FST NOT = "10"
	    DISPLAY " ERROR EN LA APERTURA " FST LINE 23, POSITION 26
	    END-IF.
	    CLOSE MAESTRO IMPRESORA.
            EXIT PROGRAM.
      *      STOP RUN.















