      **SALIDA POR IMPRESORA EN 80 POSICIONES, ENTRADA ARCHIVO INDEXADO**
	IDENTIFICATION DIVISION.
	PROGRAM-ID. MLISI1-I.
	ENVIRONMENT DIVISION.
	CONFIGURATION SECTION.
	SPECIAL-NAMES.
		    DECIMAL-POINT IS COMMA.
	INPUT-OUTPUT SECTION.
	FILE-CONTROL.
	     SELECT MAEEMP ASSIGN TO DISK "MAEEMP.IND"
	           ORGANIZATION IS INDEXED
	           ACCESS IS DYNAMIC
	           RECORD KEY IS MCA
	           FILE STATUS IS FST.
      ***   INDICAR EL PUERTO DE LA IMPRESORA EN ESTE CASO "USB001" --**
	     SELECT IMPRE ASSIGN TO PRINT  "USB001".
       DATA DIVISION.
       FILE SECTION.
       FD  MAEEMP
      	    LABEL RECORD IS STANDARD
	    RECORD CONTAINS 53 CHARACTERS
	    DATA RECORD IS R-CLI.
       01  R-CLI.
 	    02 MCA  PIC 9(08).
            02 MAN  PIC X(30).
            02 MSA  PIC 9(04).
            02 MTS  PIC 9.
            02 MTE  PIC 9(10).
       FD   IMPRE
      *	    LABEL RECORD IS OMITTED
      *      RECORD CONTAINS 80 CHARACTERS
            LINAGE 24 FOOTING 20
       	    DATA RECORD IS R-IMP.
       01   R-IMP  PIC X(80).

       WORKING-STORAGE SECTION.
       77 FST		     PIC XX.
       77 DEBE               PIC 9(04) VALUE 0.
       77 MTSD               PIC 9(05) VALUE 0.
       77 MAYD               PIC 9(04) VALUE 0.
       77 MAND               PIC X(18).
       77 MTED               PIC 9(10) VALUE 0.
       77 HABER              PIC 9(04) VALUE 0.
       77 MTSH               PIC 9(05) VALUE 0.
       77 MENH               PIC 9(04) VALUE 9999.
       77 MANH               PIC X(18).
       77 MTEH               PIC 9(10) VALUE 0.
       77 L		     PIC 9(02) VALUE 0.
       77 C-T		     PIC 99.
       77 TECLA 	     PIC X.
       01  WFECHA.
	   02 WAA		  PIC 99.
	   02 WMM		  PIC 99.
	   02 WDD		  PIC 99.

       01 TITULO-CABECERA.
	  02 FILLER PIC X(30) VALUE  SPACES.
	  02 FILLER PIC X(20) VALUE  "INFORME POR CLIENTES".
	  02 FILLER PIC X(20) VALUE  SPACES.
	  02 SDD    PIC Z9/.
	  02 SMM    PIC 99/.
	  02 SAA    PIC 9(2).

       01 TITULOS-DETALLES.
	  02 FILLER PIC X(07) VALUE  "CODIGO ".
	  02 FILLER PIC X(05) VALUE  SPACES.
	  02 FILLER PIC X(18) VALUE  "APELLIDO Y NOMBRES".
	  02 FILLER PIC X(10) VALUE  SPACES.
	  02 FILLER PIC X(04) VALUE  "DEBE".
	  02 FILLER PIC X(10) VALUE  SPACES.
	  02 FILLER PIC X(05) VALUE  "HABER".
	  02 FILLER PIC X(10) VALUE  SPACES.
	  02 FILLER PIC X(08) VALUE  "TELEFONO".

       01  SUBRAYAR-TITULOS-DETALLES.
	   02 FILLER PIC X(07) VALUE ALL "-".
	   02 FILLER PIC X(05) VALUE  SPACES.
	   02 FILLER PIC X(18) VALUE ALL "-".
	   02 FILLER PIC X(10) VALUE  SPACES.
	   02 FILLER PIC X(04) VALUE ALL "-".
	   02 FILLER PIC X(10) VALUE  SPACES.
	   02 FILLER PIC X(05) VALUE ALL "-".
	   02 FILLER PIC X(10) VALUE  SPACES.
	   02 FILLER PIC X(08) VALUE ALL "-".

       01  SALIDAS-DE-DETALLES.
	   02 DCA    PIC 9(08).
	   02 FILLER PIC X(05) VALUE  SPACES.
	   02 DAN    PIC X(18).
	   02 FILLER PIC X(09) VALUE  SPACES.
	   02 DTSD   PIC 9(04).
	   02 FILLER PIC X(10) VALUE  SPACES.
	   02 DTSH   PIC 9(04).
	   02 FILLER PIC X(10) VALUE  SPACES.
	   02 DTE    PIC 9(10).

       01  SALIDA-DE-TOTALES1.
	   02 FILLER PIC X(22) VALUE SPACES.
	   02 FILLER PIC X(11) VALUE " TOTALES = ".
	   02 FILLER PIC X(06) VALUE SPACES.
	   02 STSD   PIC ZZ.ZZ9.
	   02 FILLER PIC X(08) VALUE SPACES.
	   02 STSH   PIC ZZ.ZZ9.

       01  SALIDA-DE-TOTALES2.
	   02 FILLER PIC X(05) VALUE SPACES.
	   02 FILLER PIC X(08) VALUE "EL MAYOR".
	   02 FILLER PIC X(11) VALUE " DEBE ES = ".
	   02 SMAYD  PIC 9(04).
	   02 FILLER PIC X(22) VALUE SPACES.

       01  SALIDA-DE-TOTALES3.
	   02 FILLER PIC X(05) VALUE SPACES.
	   02 FILLER PIC X(14) VALUE "CORRESPONDE AL".
	   02 FILLER PIC X(11) VALUE " CLIENTE = ".
	   02 SAND   PIC X(18).
	   02 FILLER PIC X(22) VALUE SPACES.

       01  SALIDA-DE-TOTALES4.
	   02 FILLER PIC X(05) VALUE SPACES.
	   02 FILLER PIC X(16) VALUE "SU IMPORTE ES = ".
	   02 SSAD   PIC X(04).
	   02 FILLER PIC X(22) VALUE SPACES.

       01  SALIDA-DE-TOTALES5.
	   02 FILLER PIC X(05) VALUE SPACES.
	   02 FILLER PIC X(17) VALUE "SU TELEFONO ES = ".
	   02 STED   PIC 9(10).
	   02 FILLER PIC X(22) VALUE SPACES.

       01  SALIDA-DE-TOTALES6.
	   02 FILLER PIC X(05) VALUE SPACES.
	   02 FILLER PIC X(08) VALUE "EL MENOR".
	   02 FILLER PIC X(12) VALUE " HABER ES = ".
	   02 SMENH  PIC 9(04).
	   02 FILLER PIC X(22) VALUE SPACES.

       01  SALIDA-DE-TOTALES7.
	   02 FILLER PIC X(05) VALUE SPACES.
	   02 FILLER PIC X(14) VALUE "CORRESPONDE AL".
	   02 FILLER PIC X(11) VALUE " CLIENTE = ".
	   02 SANH   PIC X(18).
	   02 FILLER PIC X(22) VALUE SPACES.

       01  SALIDA-DE-TOTALES8.
	   02 FILLER PIC X(05) VALUE SPACES.
	   02 FILLER PIC X(16) VALUE "SU IMPORTE ES = ".
	   02 SSAH   PIC X(04).
	   02 FILLER PIC X(22) VALUE SPACES.

       01  SALIDA-DE-TOTALES9.
	   02 FILLER PIC X(05) VALUE SPACES.
	   02 FILLER PIC X(17) VALUE "SU TELEFONO ES = ".
	   02 STEH   PIC 9(10).
	   02 FILLER PIC X(22) VALUE SPACES.

       PROCEDURE DIVISION.
       INICIO.
	    OPEN INPUT	MAEEMP
		  OUTPUT IMPRE
	    ACCEPT WFECHA FROM DATE.
       SALIDA-TITULOS.
	    PERFORM IMPRIMIR-TITULOS.


       PROCESO.
	    PERFORM LEER-MAESTRO.
	    PERFORM PROCESAR-REGISTRO.
	    PERFORM MOVER-A-SALIDA.
	    PERFORM IMPRIMIR-DETALLES.
	    GO TO PROCESO.
       LEER-MAESTRO.
	      READ MAEEMP NEXT RECORD AT END GO TO IMPRIMIR-TOTALES.

       PROCESAR-REGISTRO.
	    IF MTS = 1
               MOVE MSA TO DEBE
               MOVE "0" TO HABER
               ADD MSA TO MTSD
               IF MSA > MAYD
                  MOVE MSA TO MAYD
                  MOVE MAN TO MAND
                  MOVE MTE TO MTED
               END-IF
            ELSE IF MTS = 2
                 MOVE MSA TO HABER
                 MOVE "0" TO DEBE
                 ADD MSA TO MTSH
                 IF MSA < MENH
                    MOVE MSA TO MENH
                    MOVE MAN TO MANH
                    MOVE MTE TO MTEH
                 END-IF
            END-IF.




       MOVER-A-SALIDA.
	    MOVE MCA TO DCA.
	    MOVE MAN TO DAN.
	    MOVE DEBE TO DTSD.
            MOVE HABER TO DTSH.
            MOVE MTE TO DTE.

       IMPRIMIR-TITULOS.
	    MOVE SPACES TO R-IMP.
	    MOVE WDD TO SDD.
	    MOVE WMM TO SMM.
	    MOVE WAA TO SAA.
	    IF MTE = 0
	       WRITE R-IMP FROM TITULO-CABECERA
	    ELSE
	       WRITE R-IMP FROM TITULO-CABECERA	AFTER PAGE
	    END-IF.
	       WRITE R-IMP FROM TITULOS-DETALLES	AFTER 2
	       WRITE R-IMP FROM SUBRAYAR-TITULOS-DETALLES AFTER 1.

       IMPRIMIR-DETALLES.
	    WRITE R-IMP FROM SALIDAS-DE-DETALLES   AFTER 1
		 AT EOP PERFORM IMPRIMIR-TITULOS.

       IMPRIMIR-TOTALES.
	    MOVE MTSD TO STSD.
            MOVE MTSH TO STSH.
	    MOVE MAYD TO SMAYD.
	    MOVE MAND TO SAND.
	    MOVE MAYD TO SSAD.
	    MOVE MTED TO STED.
	    MOVE MENH TO SMENH.
	    MOVE MANH TO SANH.
	    MOVE MENH TO SSAH.
	    MOVE MTEH TO STEH.
	    WRITE R-IMP FROM SALIDA-DE-TOTALES1  AFTER 3.
	    WRITE R-IMP FROM SALIDA-DE-TOTALES2  AFTER 1.
	    WRITE R-IMP FROM SALIDA-DE-TOTALES3  AFTER 1.
            WRITE R-IMP FROM SALIDA-DE-TOTALES3  AFTER 1.
	    WRITE R-IMP FROM SALIDA-DE-TOTALES3  AFTER 1.
	    WRITE R-IMP FROM SALIDA-DE-TOTALES3  AFTER 1.
	    WRITE R-IMP FROM SALIDA-DE-TOTALES3  AFTER 1.
	    WRITE R-IMP FROM SALIDA-DE-TOTALES3  AFTER 1.
	    WRITE R-IMP FROM SALIDA-DE-TOTALES3  AFTER 1.
	    MOVE SPACES TO R-IMP.
	    WRITE R-IMP.

       FIN.
	    DISPLAY "IMPRIMIENDO->CONTROLE LA IMPRESORA..TARDA UN POCO"
	     LINE 20, POSITION 01 CONTROL "FCOLOR=RED", BLINK
	    DISPLAY "PULSE EL  BOTON DEL PAPEL.....CUANDO TINTINEA"
	     LINE 22, POSITION 30 CONTROL "FCOLOR=RED"
	    DISPLAY "PULSE UNA TECLA PARA CONTINUAR"
	     LINE 23, POSITION 01 CONTROL "FCOLOR=GREEN", BLINK
	     ACCEPT TECLA
	    DISPLAY " " ERASE CONTROL "FCOLOR=WHITE,BCOLOR=BLACK".
	    IF	FST  > "00" AND FST NOT = "10"
	    DISPLAY " ERROR EN LA APERTURA " FST LINE 23, POSITION 26
	    END-IF.
	    CLOSE MAEEMP IMPRE
	    EXIT PROGRAM.
      *      STOP RUN.
