      **SALIDA POR IMPRESORA EN 80 POSICIONES, ENTRADA ARCHIVO INDEXADO**
	IDENTIFICATION DIVISION.
	PROGRAM-ID. MLISI1-I.
	ENVIRONMENT DIVISION.
	CONFIGURATION SECTION.
	SPECIAL-NAMES.
		    DECIMAL-POINT IS COMMA.
	INPUT-OUTPUT SECTION.
	FILE-CONTROL.
	     SELECT MAEEMP ASSIGN TO DISK "MAEEMP.IND"
	           ORGANIZATION IS INDEXED
	           ACCESS IS DYNAMIC
	           RECORD KEY IS MCA
	           ALTERNATE RECORD KEY IS MAN DUPLICATES
	           FILE STATUS IS FST.

      ***   INDICAR EL PUERTO DE LA IMPRESORA EN ESTE CASO "USB001" --**
	     SELECT IMPRE ASSIGN TO PRINT  "USB002".
       DATA DIVISION.
       FILE SECTION.
       FD  MAEEMP
      	    LABEL RECORD IS STANDARD
	    RECORD CONTAINS 42 CHARACTERS
	    DATA RECORD IS R-CLI.
       01  R-CLI.
 	    02 MCA      PIC 9(8).
            02 MAN      PIC X(30).
            02 MANT     PIC 9(2).
            02 MSE      PIC 9.
            02 MCATE    PIC 9.

       FD   IMPRE
      *	    LABEL RECORD IS OMITTED
      *      RECORD CONTAINS 80 CHARACTERS
            LINAGE 24 FOOTING 20
       	    DATA RECORD IS R-IMP.
       01   R-IMP  PIC X(80).

       WORKING-STORAGE SECTION.
       77 FST		     PIC XX.
       77 MTE		     PIC 9(5) VALUE 0.
       77 MTV		     PIC 9(5) VALUE 0.
       77 MTM		     PIC 9(5) VALUE 0.
       77 L		     PIC 9(2) VALUE 0.
       77 MTVMA              PIC 9(5) VALUE 0.
       77 MTMMA              PIC 9(5) VALUE 0.
       77 MTMAE              PIC 9(5) VALUE 0.
       77 MTMC               PIC 9(5) VALUE 0.
       77 C-T		     PIC 99.
       77 TECLA 	     PIC X.
       01  WFECHA.
	   02 WAA		  PIC 99.
	   02 WMM		  PIC 99.
	   02 WDD		  PIC 99.

       01 TITULO-CABECERA.
	  02 FILLER PIC X(30) VALUE  SPACES.
	  02 FILLER PIC X(19) VALUE  "PADRON DE EMPLEADOS".
	  02 FILLER PIC X(23) VALUE  SPACES.
	  02 SDD    PIC Z9/.
	  02 SMM    PIC 99/.
	  02 SAA    PIC 9(2).

       01 TITULOS-DETALLES.
	  02 FILLER PIC X(12) VALUE  "DNI.EMPLEADO".
	  02 FILLER PIC X(01) VALUE  SPACES.
	  02 FILLER PIC X(30) VALUE  "	    APELLIDO Y NOMBRES	    ".
	  02 FILLER PIC X(01) VALUE  SPACES.
	  02 FILLER PIC X(04) VALUE  "SEXO".
	  02 FILLER PIC X(03) VALUE  SPACES.
	  02 FILLER PIC X(12) VALUE  "ANTIGUEDAD".
	  02 FILLER PIC X(04) VALUE  SPACES.
          02 FILLER PIC X(09) VALUE  "CATEGORIA".



       01  SUBRAYAR-TITULOS-DETALLES.
	   02 FILLER PIC X(12) VALUE ALL "-".
	   02 FILLER PIC X(01) VALUE  SPACES.
	   02 FILLER PIC X(30) VALUE ALL "-".
	   02 FILLER PIC X(01) VALUE  SPACES.
	   02 FILLER PIC X(04) VALUE ALL "-".
	   02 FILLER PIC X(03) VALUE  SPACES.
	   02 FILLER PIC X(12) VALUE ALL "-".
	   02 FILLER PIC X(04) VALUE  SPACES.
	   02 FILLER PIC X(06) VALUE ALL "-".

       01  SALIDAS-DE-DETALLES.
	   02 DCA    PIC 9(08).
	   02 FILLER PIC X(05) VALUE  SPACES.
	   02 DAN    PIC X(20).
	   02 FILLER PIC X(10) VALUE  SPACES.
	   02 DSE    PIC X(06).
	   02 FILLER PIC X(05) VALUE  SPACES.
	   02 DANT    PIC X(08).
	   02 FILLER PIC X(05) VALUE  SPACES.
	   02 DCATE    PIC X(09).

       01  SALIDA-DE-TOTALES1.
	   02 FILLER PIC X(3) VALUE SPACES.
	   02 FILLER PIC X(19) VALUE "TOTAL PERSONAS    ".
	   02 FILLER PIC X(19) VALUE "		            =".
	   02 SMTE   PIC ZZ.ZZ9.
	   02 FILLER PIC X(22) VALUE SPACES.

       01  SALIDA-DE-TOTALES2.
	   02 FILLER PIC X(3) VALUE SPACES.
	   02 FILLER PIC X(19) VALUE "TOTAL VARONES     ".
	   02 FILLER PIC X(19) VALUE "		            =".
	   02 SMTV   PIC ZZ.ZZ9.
	   02 FILLER PIC X(22) VALUE SPACES.

       01  SALIDA-DE-TOTALES3.
	   02 FILLER PIC X(3) VALUE SPACES.
	   02 FILLER PIC X(19) VALUE "TOTAL MUJERES     ".
	   02 FILLER PIC X(19) VALUE "		            =".
	   02 SMTM   PIC ZZ.ZZ9.
	   02 FILLER PIC X(22) VALUE SPACES.

       01  SALIDA-DE-TOTALES4.
	   02 FILLER PIC X(3) VALUE SPACES.
	   02 FILLER PIC X(19) VALUE "TOTAL DE VARONES MA".
	   02 FILLER PIC X(19) VALUE "ORES A 20 A¥OS    =".
	   02 STVMA   PIC ZZ.ZZ9.
	   02 FILLER PIC X(22) VALUE SPACES.

       01  SALIDA-DE-TOTALES5.
	   02 FILLER PIC X(3) VALUE SPACES.
	   02 FILLER PIC X(19) VALUE "TOTAL DE MUJERES MA".
	   02 FILLER PIC X(19) VALUE "ORES A 18 A¥OS    =".
	   02 STMMA   PIC ZZ.ZZ9.
	   02 FILLER PIC X(22) VALUE SPACES.

       01  SALIDA-DE-TOTALES6.
	   02 FILLER PIC X(3) VALUE SPACES.
	   02 FILLER PIC X(19) VALUE "TOTAL DE MUJERES EN".
	   02 FILLER PIC X(19) VALUE "TRE 18 Y 30       =".
	   02 STMMAE   PIC ZZ.ZZ9.
	   02 FILLER PIC X(22) VALUE SPACES.

       01  SALIDA-DE-TOTALES7.
	   02 FILLER PIC X(3) VALUE SPACES.
	   02 FILLER PIC X(19) VALUE "TOTAL DE MUJERES CH".
	   02 FILLER PIC X(19) VALUE "OFER              =".
	   02 STMC   PIC ZZ.ZZ9.
	   02 FILLER PIC X(22) VALUE SPACES.

       PROCEDURE DIVISION.
       INICIO.
	    OPEN INPUT	MAEEMP
		  OUTPUT IMPRE
	    ACCEPT WFECHA FROM DATE.
       SALIDA-TITULOS.
	    PERFORM IMPRIMIR-TITULOS.


       PROCESO.
	    PERFORM LEER-MAESTRO.
	    PERFORM PROCESAR-REGISTRO.
	    PERFORM MOVER-A-SALIDA.
	    PERFORM IMPRIMIR-DETALLES.
	    GO TO PROCESO.
       LEER-MAESTRO.
	      READ MAEEMP NEXT RECORD AT END GO TO IMPRIMIR-TOTALES.

       PROCESAR-REGISTRO.
	    ADD 1 TO MTE
	    IF MSE = 1
		ADD 1 TO MTV
	    END-IF.
	    IF MSE = 1 AND MANT >= 20
	    ADD 1 TO MTVMA
	    END-IF.
            IF MSE = 2
		ADD 1 TO MTM
		END-IF.
            IF  MSE = 2 AND MANT >= 18
		     ADD 1 TO MTMMA
                END-IF.
            IF MSE = 2 AND (MANT >= 18 AND < 30)
                  ADD 1 TO MTMAE
            IF MSE = 2 AND MCATE = 3
            ADD 1 TO MTMC
            END-IF.
            IF MSE = 1
               MOVE "VARON" TO DSE
                ELSE IF MSE = 2
                 MOVE "MUJER" TO DSE
            END-IF.
            IF MCATE = 1
                MOVE "ADMINIS" TO DCATE
               ELSE IF MCATE = 2
                MOVE "MECANICO" TO DCATE
               ELSE IF MCATE = 3
                MOVE "CHOFER" TO DCATE
               ELSE IF MCATE = 4
                    MOVE "OTROS" TO DCATE
               END-IF.



       MOVER-A-SALIDA.
	    MOVE MCA TO DCA.
	    MOVE MAN TO DAN.
	    MOVE MANT TO DANT.

       IMPRIMIR-TITULOS.
	    MOVE SPACES TO R-IMP.
	    MOVE WDD TO SDD.
	    MOVE WMM TO SMM.
	    MOVE WAA TO SAA.
	    IF MTE = 0
	       WRITE R-IMP FROM TITULO-CABECERA
	    ELSE
	       WRITE R-IMP FROM TITULO-CABECERA	AFTER PAGE
	    END-IF.
	       WRITE R-IMP FROM TITULOS-DETALLES	AFTER 2
	       WRITE R-IMP FROM SUBRAYAR-TITULOS-DETALLES AFTER 1.

       IMPRIMIR-DETALLES.
	    WRITE R-IMP FROM SALIDAS-DE-DETALLES   AFTER 1
		 AT EOP PERFORM IMPRIMIR-TITULOS.

       IMPRIMIR-TOTALES.
	    MOVE MTE  TO SMTE.
	    MOVE MTV TO SMTV.
	    MOVE MTM TO SMTE.
	    WRITE R-IMP FROM SALIDA-DE-TOTALES1  AFTER 3.
	    WRITE R-IMP FROM SALIDA-DE-TOTALES2  AFTER 1.
	    WRITE R-IMP FROM SALIDA-DE-TOTALES3  AFTER 1.
	    WRITE R-IMP FROM SALIDA-DE-TOTALES4  AFTER 1.
	    WRITE R-IMP FROM SALIDA-DE-TOTALES5  AFTER 1.
	    WRITE R-IMP FROM SALIDA-DE-TOTALES6  AFTER 1.
	    WRITE R-IMP FROM SALIDA-DE-TOTALES7  AFTER 1.
            MOVE SPACES TO R-IMP.
	    WRITE R-IMP.

       FIN.
	    DISPLAY "IMPRIMIENDO->CONTROLE LA IMPRESORA..TARDA UN POCO"
	     LINE 20, POSITION 01 CONTROL "FCOLOR=RED", BLINK
	    DISPLAY "PULSE EL  BOTON DEL PAPEL.....CUANDO TINTINEA"
	     LINE 22, POSITION 30 CONTROL "FCOLOR=RED"
	    DISPLAY "PULSE UNA TECLA PARA CONTINUAR"
	     LINE 23, POSITION 01 CONTROL "FCOLOR=GREEN", BLINK
	     ACCEPT TECLA
	    DISPLAY " " ERASE CONTROL "FCOLOR=WHITE,BCOLOR=BLACK".
	    IF	FST  > "00" AND FST NOT = "10"
	    DISPLAY " ERROR EN LA APERTURA " FST LINE 23, POSITION 26
	    END-IF.
	    CLOSE MAEEMP IMPRE
	    EXIT PROGRAM.
      *      STOP RUN.
