      **SALIDA POR IMPRESORA EN 80 POSICIONES, ENTRADA ARCHIVO SECUENCIAL ORDENADO**
	IDENTIFICATION DIVISION.
	PROGRAM-ID. MLISI1-S.
	ENVIRONMENT DIVISION.
	CONFIGURATION SECTION.
	SPECIAL-NAMES.
		    DECIMAL-POINT IS COMMA.
	INPUT-OUTPUT SECTION.
	FILE-CONTROL.
	     SELECT MAEEMP ASSIGN TO DISK "MAEEMP.ORD"
	           ORGANIZATION IS SEQUENTIAL
	           ACCESS IS SEQUENTIAL.

      ***   INDICAR EL PUERTO DE LA IMPRESORA EN ESTE CASO "USB001" --**
	     SELECT IMPRE ASSIGN TO PRINT  "USB001".
       DATA DIVISION.
       FILE SECTION.
       FD  MAEEMP
      	    LABEL RECORD IS STANDARD
	    RECORD CONTAINS 44 CHARACTERS
	    DATA RECORD IS R-CLI.
       01  R-CLI.
 	    02 MCA  PIC 9(3).
	    02 MAN  PIC X(30).
	    02 MED  PIC 9(3).
	    02 MSE  PIC 9.
	    02 MEC  PIC 9.
	    02 MFI.
	       03  MDD	PIC 9(2).
	       03  MMM	PIC 9(2).
	       03  MAA	PIC 9(2).
       FD   IMPRE
      *	    LABEL RECORD IS OMITTED
      *      RECORD CONTAINS 80 CHARACTERS
            LINAGE 62 FOOTING 60
       	    DATA RECORD IS R-IMP.
       01   R-IMP  PIC X(80).

       WORKING-STORAGE SECTION.
       77 FST		     PIC XX.
       77 MTE		     PIC 9(5) VALUE 0.
       77 MTVC		     PIC 9(5) VALUE 0.
       77 MTME		     PIC 9(5) VALUE 0.
       77 L		     PIC 9(2) VALUE 0.
       77 C-T		     PIC 99.
       77 TECLA 	     PIC X.

       01  WFECHA.
	   02 WAA		  PIC 99.
	   02 WMM		  PIC 99.
	   02 WDD		  PIC 99.

       01 TITULO-CABECERA.
	  02 FILLER PIC X(30) VALUE  SPACES.
	  02 FILLER PIC X(19) VALUE  "PADRON DE EMPLEADOS".
	  02 FILLER PIC X(23) VALUE  SPACES.
	  02 SDD    PIC Z9/.
	  02 SMM    PIC 99/.
	  02 SAA    PIC 9(2).

       01 TITULOS-DETALLES.
	  02 FILLER PIC X(12) VALUE  "NRO.EMPLEADO".
	  02 FILLER PIC X(01) VALUE  SPACES.
	  02 FILLER PIC X(30) VALUE  "	    APELLIDO Y NOMBRES	    ".
	  02 FILLER PIC X(01) VALUE  SPACES.
	  02 FILLER PIC X(04) VALUE  "EDAD".
	  02 FILLER PIC X(01) VALUE  SPACES.
	  02 FILLER PIC X(04) VALUE  "SEXO".
	  02 FILLER PIC X(01) VALUE  SPACES.
	  02 FILLER PIC X(12) VALUE  "ESTADO CIVIL".
	  02 FILLER PIC X(01) VALUE  SPACES.
	  02 FILLER PIC X(13) VALUE  "FECHA INGRESO".



       01  SUBRAYAR-TITULOS-DETALLES.
	   02 FILLER PIC X(12) VALUE ALL "-".
	   02 FILLER PIC X(01) VALUE  SPACES.
	   02 FILLER PIC X(30) VALUE ALL "-".
	   02 FILLER PIC X(01) VALUE  SPACES.
	   02 FILLER PIC X(04) VALUE ALL "-".
	   02 FILLER PIC X(01) VALUE  SPACES.
	   02 FILLER PIC X(04) VALUE ALL "-".
	   02 FILLER PIC X(01) VALUE  SPACES.
	   02 FILLER PIC X(12) VALUE ALL "-".
	   02 FILLER PIC X(01) VALUE  SPACES.
	   02 FILLER PIC X(13) VALUE ALL "-".

       01  SALIDAS-DE-DETALLES.
	   02 FILLER PIC X(05) VALUE  SPACES.
	   02 DCA    PIC 9(03).
	   02 FILLER PIC X(05) VALUE  SPACES.
	   02 DAN    PIC X(30).
	   02 FILLER PIC X(02) VALUE  SPACES.
	   02 DED    PIC 9(03).
	   02 FILLER PIC X(02) VALUE  SPACES.
	   02 DSE    PIC X(01).
	   02 FILLER PIC X(08) VALUE  SPACES.
	   02 DEC    PIC X(01).
	   02 FILLER PIC X(12) VALUE  SPACES.
	   02 DDD    PIC Z9/.
	   02 DMM    PIC 99/.
	   02 DAA    PIC 9(02).

       01  SALIDA-DE-TOTALES1.
	   02 FILLER PIC X(16) VALUE SPACES.
	   02 FILLER PIC X(19) VALUE "TOTAL DE EMPLEADOS ".
	   02 FILLER PIC X(18) VALUE "		       =".
	   02 STE    PIC ZZ.ZZ9.
	   02 FILLER PIC X(22) VALUE SPACES.

       01  SALIDA-DE-TOTALES2.
	   02 FILLER PIC X(16) VALUE SPACES.
	   02 FILLER PIC X(19) VALUE "TOTAL DE VARONES CA".
	   02 FILLER PIC X(18) VALUE "SADOS	       =".
	   02 STVC   PIC ZZ.ZZ9.
	   02 FILLER PIC X(22) VALUE SPACES.



       01  SALIDA-DE-TOTALES3.
	   02 FILLER PIC X(16) VALUE SPACES.
	   02 FILLER PIC X(19) VALUE "TOTAL DE MUJERES EN".
	   02 FILLER PIC X(18) VALUE "TRE 18 Y 35 A¥OS =".
	   02 STME   PIC ZZ.ZZ9.
	   02 FILLER PIC X(22) VALUE SPACES.

       PROCEDURE DIVISION.
       INICIO.
	    OPEN INPUT	MAEEMP
		  OUTPUT IMPRE
	    ACCEPT WFECHA FROM DATE.
       SALIDA-TITULOS.
	    PERFORM IMPRIMIR-TITULOS.


       PROCESO.
	    PERFORM LEER-MAESTRO.
	    PERFORM PROCESAR-REGISTRO.
	    PERFORM MOVER-A-SALIDA.
	    PERFORM IMPRIMIR-DETALLES.
	    GO TO PROCESO.
       LEER-MAESTRO.
	      READ MAEEMP NEXT RECORD AT END GO TO IMPRIMIR-TOTALES.

       PROCESAR-REGISTRO.
	    ADD 1 TO MTE
	    IF MSE = 1 AND MEC = 1
		ADD 1 TO MTVC
	    END-IF.
	    IF MSE = 2
		IF  MED > 17 AND MED < 36
		    ADD 1 TO MTME
		END-IF
	    END-IF.



       MOVER-A-SALIDA.
	    MOVE MCA TO DCA.
	    MOVE MAN TO DAN.
	    MOVE MED TO DED.
	    MOVE MSE TO DSE.
	    MOVE MEC TO DEC.
	    MOVE MDD TO DDD.
	    MOVE MMM TO DMM.
	    MOVE MAA TO DAA.

       IMPRIMIR-TITULOS.
	    MOVE SPACES TO R-IMP.
	    MOVE WDD TO SDD.
	    MOVE WMM TO SMM.
	    MOVE WAA TO SAA.
	    IF MTE = 0
	       WRITE R-IMP FROM TITULO-CABECERA
	    ELSE
	       WRITE R-IMP FROM TITULO-CABECERA	AFTER PAGE
	    END-IF.
	       WRITE R-IMP FROM TITULOS-DETALLES	AFTER 2
	       WRITE R-IMP FROM SUBRAYAR-TITULOS-DETALLES AFTER 1.

       IMPRIMIR-DETALLES.
	    WRITE R-IMP FROM SALIDAS-DE-DETALLES   AFTER 1
		 AT EOP PERFORM IMPRIMIR-TITULOS.

       IMPRIMIR-TOTALES.
	    MOVE MTE  TO STE.
	    MOVE MTVC TO STVC.
	    MOVE MTME TO STME.
	    WRITE R-IMP FROM SALIDA-DE-TOTALES1  AFTER 3.
	    WRITE R-IMP FROM SALIDA-DE-TOTALES2  AFTER 1.
	    WRITE R-IMP FROM SALIDA-DE-TOTALES3  AFTER 1.
	    MOVE SPACES TO R-IMP.
	    WRITE R-IMP.

       FIN.
	    DISPLAY "IMPRIMIENDO->CONTROLE LA IMPRESORA..TARDA UN POCO"
	     LINE 20, POSITION 01 CONTROL "FCOLOR=RED", BLINK
	    DISPLAY "PULSE EL  BOTON DEL PAPEL.....CUANDO TINTINEA"
	     LINE 22, POSITION 30 CONTROL "FCOLOR=RED"
	    DISPLAY "PULSE UNA TECLA PARA CONTINUAR"
	     LINE 23, POSITION 01 CONTROL "FCOLOR=GREEN", BLINK
	     ACCEPT TECLA
	    DISPLAY " " ERASE CONTROL "FCOLOR=WHITE,BCOLOR=BLACK".
	    IF	FST  > "00" AND FST NOT = "10"
	    DISPLAY " ERROR EN LA APERTURA " FST LINE 23, POSITION 26
	    END-IF.
	    CLOSE MAEEMP IMPRE
	    EXIT PROGRAM.
      *      STOP RUN.
